{"class_name": "Model", "keras_version": "2.0.5", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 15000, 1], "name": "input_48", "sparse": false}, "inbound_nodes": [], "name": "input_48"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_165"}, "inbound_nodes": [[["input_48", 0, 0, {}]]], "name": "dropout_165"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_47", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 15, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [24]}, "inbound_nodes": [[["dropout_165", 0, 0, {}]]], "name": "conv1d_47"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [24], "trainable": true, "name": "max_pooling1d_47", "pool_size": [24]}, "inbound_nodes": [[["conv1d_47", 0, 0, {}]]], "name": "max_pooling1d_47"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_166"}, "inbound_nodes": [[["max_pooling1d_47", 0, 0, {}]]], "name": "dropout_166"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 248], "name": "input_47", "sparse": false}, "inbound_nodes": [], "name": "input_47"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_48", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [2], "dilation_rate": [1], "kernel_regularizer": null, "filters": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [28]}, "inbound_nodes": [[["dropout_166", 0, 0, {}]]], "name": "conv1d_48"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_162"}, "inbound_nodes": [[["input_47", 0, 0, {}]]], "name": "dropout_162"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [14], "trainable": true, "name": "max_pooling1d_48", "pool_size": [14]}, "inbound_nodes": [[["conv1d_48", 0, 0, {}]]], "name": "max_pooling1d_48"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_93", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 150, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_162", 0, 0, {}]]], "name": "dense_93"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_167"}, "inbound_nodes": [[["max_pooling1d_48", 0, 0, {}]]], "name": "dropout_167"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_163"}, "inbound_nodes": [[["dense_93", 0, 0, {}]]], "name": "dropout_163"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_24"}, "inbound_nodes": [[["dropout_167", 0, 0, {}]]], "name": "flatten_24"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_94", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 12, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_163", 0, 0, {}]]], "name": "dense_94"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_95", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 12, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_24", 0, 0, {}]]], "name": "dense_95"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_164"}, "inbound_nodes": [[["dense_94", 0, 0, {}]]], "name": "dropout_164"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_168"}, "inbound_nodes": [[["dense_95", 0, 0, {}]]], "name": "dropout_168"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_24", "axis": -1}, "inbound_nodes": [[["dropout_164", 0, 0, {}], ["dropout_168", 0, 0, {}]]], "name": "concatenate_24"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_96", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_24", 0, 0, {}]]], "name": "dense_96"}], "input_layers": [["input_47", 0, 0], ["input_48", 0, 0]], "output_layers": [["dense_96", 0, 0]], "name": "model_24"}, "backend": "tensorflow"}